# Задача 21
# Напишите программу для печати всех уникальных значений в словаре.

dict = {'V' : '124', 'VI' : '124', 'VII' : '643', 'VIII' : '613', 'IX' : '37458', 'X' : '513'}
a = set()
for i in dict.values():
    a.add(i)
print(a)

