# Задача 32: Определить индексы элементов массива (списка),
# значения которых принадлежат заданному диапазону: (5-15) (т.е. не
# меньше заданного минимума и не больше заданного максимума).

# Ввод: [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
# Вывод: [1, 9, 13, 14, 19]

list1 = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
print(list1)
def Index(some_list):
    index_result = list()
    for i in range(0, len(some_list)):
        if 5 < some_list[i] < 15:
            index_result.append(i)
    print(index_result)
Index(list1)


