# 6.Четырехзначное?
# Пользователь вводит целое число. 
# Выведите YES, если это число является четырехзначным,
# и NO в противном случае.

a = int (input("Введите число "))

if 10000 > a > 999 :
    print ("Yes")
else : print ("No")
